[
  {
    "title": "What is Poker?",
    "content": "Poker at all online casinos is a card game that is extremely popular in online casinos such as betida.com. The goal is to have the best five-card poker hand from the cards dealt. Little and big blinds are posted before the hand starts. The dealer deals two hole cards to each player. Whether starting out on online poker or if you're an experienced player, you'll love playing poker online games against friends and other players at BETIDA Casino."
  },
  {
    "title": "How to Play Poker?",
    "content": "How to Play Poker at BETIDA? First need to create an account at BETIDA Casino, take poker to start to play. The dealer deals two hole cards to each player. The object is to win the pot. The pot is the sum of money or chips that players bet during the hand. To win the pot, you need to have the best five-card poker hand according to the rankings below or get all other players to fold."
  },
  {
    "title": "Poker Game Types",
    "subsections": [
      {
        "title": "Texas Hold'em",
        "content": "The goal of the game is to have a better hand. Omaha rules are only similar to Texas Hold'em, except that each player receives four face down cards instead of two. Their hand consists of exactly two of their hole cards and three from the community cards to form a five-card hand."
      },
      {
        "title": "Omaha",
        "content": "Omaha rules are only similar to Texas Hold'em, except that each player receives four face down cards instead of two. Their hand consists of exactly two of their hole cards and three from the community cards to form a five-card hand."
      }
    ]
  },
  {
    "title": "BETIDA Poker Hand Rankings",
    "subsections": [
      {
        "title": "Royal Flush",
        "content": "A Royal Flush is the best hand in poker, consisting of an Ace, King, Queen, Jack, and Ten of the same suit."
      },
      {
        "title": "Straight Flush",
        "content": "A Straight Flush can only be beaten by a Royal Flush or a higher Straight Flush. In the event of a tie, the winner is determined by the highest card of the straight."
      },
      {
        "title": "Four of a Kind",
        "content": "Four cards of the same rank and one card of a different rank. In the event of a tie, the winner is determined by the highest four of a kind."
      },
      {
        "title": "Full House",
        "content": "Consists of three of a kind and a pair of a different rank. The player with the higher three of a kind wins. If they are the same, the pair decides the winner."
      },
      {
        "title": "Flush",
        "content": "Five cards of the same suit, not in sequence. The winner is the flush with the highest card in the hand. If they have the same highest card, the next highest card is compared, and so on."
      },
      {
        "title": "Straight",
        "content": "A hand consisting of five consecutive cards of different suits."
      },
      {
        "title": "Three of a Kind",
        "content": "Three cards of the same rank and two unrelated cards. The highest three of a kind wins. If the same, the highest unrelated card decides."
      },
      {
        "title": "Two Pair",
        "content": "Two pairs of different ranks and one unrelated card. The winner is determined by the highest pair. If the same, the second pair, then the unrelated card."
      },
      {
        "title": "One Pair",
        "content": "Two cards of the same rank and three unrelated cards. If tie, the highest pair wins. If same, the highest unrelated card decides."
      },
      {
        "title": "High Card",
        "content": "If no one has any of the above categories, the winner is the player with the highest card. Subsequent cards are compared if tie."
      }
    ]
  },
  {
    "title": "Depositing to Play Poker at BETIDA and Responsible Gaming",
    "content": "At BETIDA you can play with fiat or crypto currencies on poker games. BETIDA accepts CLP, ARS, CAD, BRL, INR, IDR, and TRY. We have more options for good balance with different currencies you can play on our platform. BETIDA Poker with cryptocurrency. At BETIDA you can buy crypto directly on our platform with credit card or other payment methods. BETIDAholder can learn how to keep your money safe while playing at BETIDA Casino. Learn more. Please view our responsible gaming guide so you don't exceed the limits. Our BETIDA Smart tool lets you see how much budget you can allocate to each of games."
  },
  {
    "title": "Other Popular Casino Games Exclusive to BETIDA",
    "content": "BETIDA Original - Among the popular online casino games. We also have Dice, Crash, Plinko, Mines, etc. From live dealer games to slot games. If you play on BETIDA platform, get VIP bonuses and promotions. More information before you start? The online guide to tips for casino games on our platform. Also our monthly budget calculator can also calculate how much you can allocate to games."
  }
]